$(document).ready(function(){
/******************************************************
***********************로그인 폼 체크************************/
$("#btnLogin").click(function(){
	if($("#id").val() == "") {
		alert("아이디를 입력해주세요");
		$("#id").focus();
		return false;
	}else if($("#pass").val() == "") {
		alert("비밀번호를 입력해주세요");
		$("#pass").focus();
		return false;
	}else {
		loginForm.submit();
	}
});

/********************************************************
				로그인폼 다시쓰기 버튼 focus
*********************************************************/
$("#btnLoginReset").click(function(){ $("#id").val("").focus(); $("#pass").val(""); });
/********************************************************
 * 					회원가입 폼 체크
*********************************************************/
$("#btnJoin").click(function(){
	if($("#id").val()=="") {
		alert("아이디는 필수 정보입니다");
		$("#id").focus();
		return false;
	}else if($("#pwd").val()=="") {
		alert("비밀번호는 필수 정보입니다");
		$("#pwd").focus();
		return false;
	}else if($("#cpwd").val()=="") {
		alert("비밀번호 확인을 입력해주세요");
		$("#cpwd").focus();
		return false;
	}else if($("#name").val()=="") {
		alert("이름은 필수 정보입니다");
		$("#name").focus();
		return false;
	}else if($("input[name='gender']:checked").length == 0) {
		alert("성별을 선택해주세요");
		$("input:radio[name='gender']").eq(0).focus();
		return false;
	}else if($("#email1").val()==""){
		alert("이메일을 입력해주세요");
		$("#email1").focus();
		return false;
	}else if($("#email2").val()==""){
		alert("이메일을 선택하거나 입력해주세요");
		$("#email2").focus();
		return false;
	}else if($("#email3").val()=="default"){
		alert("이메일을 선택하거나 직접입력 해주세요");
		$("email3").focus();
		return false;
	}else if($("#addr1").val()==""){
		alert("주소를 입력해주세요");
		$("#addr1").focus();
		return false;
	}else if($("#addr2").val()==""){
		alert("상세 주소를 입력해주세요");
		$("#addr2").focus();
		return false;
	}else if($("input[name='phone']:checked").length == 0) {
		alert("통신사를 선택해주세요");
		$("input[name='phone']").focus();
		return false;
	}else if($("#phone1").val() == "default") {
		alert("휴대전화 앞자리를 선택해주세요");
		$("#phone1").focus();
		return false;
	}else if($("#phone2").val()=="") {
		alert("휴대전화를 입력해주세요");
		$("#phone2").focus();
		return false;
	}else if($("#phone3").val()=="") {
		alert("휴대전화를 입력해주세요");
		$("#phone3").focus();
		return false;
	}else if($("input[name='hobby']:checked").length == 0){
		alert("취미를 선택해주세요");
		$("input[name='hobby']").focus();
		return false;
	}else {
		joinForm.submit();
	}
});

/********************************************************
			회원가입 폼 체크 - 비밀번호 & 비밀번호 확인
*********************************************************/
$("#cpwd").on("blur", function(){
	if($("#pwd").val() != "" && $("#cpwd").val() != "") {
		if($("#pwd").val() == $("#cpwd").val()) {
			$("#cmsg").text("비밀번호가 동일합니다").css("color","blue").css("display","block");
			$("#name").focus();
		}else {
			$("#cmsg").text("비밀번호가 서로 다릅니다").css("color","red").css("display","block");
			
			$("#pwd").val("").focus();
			$("#cpwd").val("");
		}
	}
});
/********************************************************
		이메일 selectbox 선택 시 input창에 값을 넣는 스크립트
*********************************************************/
$("#email3").on("change", function() {
	if($("#email3").val() == "default"){
		alert("이메일을 선택해주세요");
		$("#email2").val("");
		$("#email3").focus();
	} if($("#email3").val() == "self"){
		$("#email2").val("").focus();
	}else {
		$("#email2").val($("#email3").val());
	}
});

/********************************************************
					주소 찾기 API
*********************************************************/
$("#btnSearchAddr").click(function(){
	 new daum.Postcode({
	        oncomplete: function(data) {
	        	$("#addr1").val("("+data.zonecode+") "+data.address);
	        	$("#addr2").focus();
	        }
	    }).open();
});
   


/********************************************************
				게시판 제목 validation check
*********************************************************/

	
/********************************************************
*********************************************************/

});











/********************************************************
*********************************************************/








/********************************************************
*********************************************************/








/********************************************************
*********************************************************/






/********************************************************
*********************************************************/









/********************************************************
*********************************************************/








/********************************************************
*********************************************************/








/********************************************************
*********************************************************/